import matplotlib.pyplot as plt

# DiskHivf 数据
diskhivf_lacency = [
    1157.6,
    1361.91,
    1622.16,
    1837.14,
    2007.82,
    2413.86,
    2501.75,
    2923.26,
    3073.61,
    3658.53,
    4261.78,
    4771.28,
    5735.85,
    6250.59,
    8303.49,
    9186.55,
    11141.1,
    12587.7,
    16054.3,
    19405.3,
    22225,
    22280.2,
    24000.8,
]
diskhivf_recall = [
    81.4927,
    82.6060,
    85.3422,
    86.5593,
    87.6162,
    88.7933,
    89.0837,
    89.9049,
    90.0466,
    91.0035,
    91.6940,
    92.3034,
    92.9596,
    93.3217,
    94.2159,
    94.4700,
    94.8726,
    95.1752,
    95.5656,
    96.0584,
    96.3266,
    96.3862,
    96.5482,
]

# Diskann 数据
diskann_lacency = [
    2827.74,
    3083.61,
    3263.43,
    3498.19,
    4106.77,
    4587.5,
    5737.78,
    6878.44,
    8045.25,
    10384.7,
    12839.76,
    18698.47,
    24251.81,

]
diskann_recall = [
    83.06,
    85.37,
    87.03,
    88.25,
    90.25,
    91.49,
    92.91,
    93.76,
    94.29,
    94.96,
    95.34,
    95.89,
    96.13,
]

# spann 数据
spann_lacency = [
    1251,
    1452,
    1654,
    1854,
    2055,
    2556,
    3057,
    3557,
    4056,
    6050,
    8042,
    10030,
    19903,
    24808,
]
spann_recall = [
    82.4661,
    83.6133,
    84.5228,
    85.2801,
    85.8896,
    87.173,
    88.0244,
    88.74,
    89.2776,
    90.7408,
    91.5615,
    92.0965,
    93.6946,
    94.145,
]

# starling 数据
starling_lacency = [
    2796.62,
    2862.78,
    2949.94,
    2944.78,
    3079.36,
    3208.86,
    3800.12,
    4413.6,
    5138.87,
    6570.48,
    8176.2,
    9802.69,
    11460.08,
    13297.76,
    14670.11,
    18330.94,
    22294.39,
]
starling_recall = [
    82.63,
    85.51,
    86.58,
    87.44,
    88.78,
    89.82,
    92.47,
    93.57,
    94.18,
    95.06,
    95.46,
    95.71,
    95.87,
    96,
    96.1,
    96.25,
    96.37,
]

# 创建折线图
plt.figure(figsize=(10, 6))

plt.plot(diskhivf_lacency, diskhivf_recall, marker='o', label='DiskHivf')
plt.plot(diskann_lacency, diskann_recall, marker='o', label='Diskann')
plt.plot(spann_lacency, spann_recall, marker='o', label='spann')
plt.plot(starling_lacency, starling_recall, marker='o', label='starling')

# 添加标题和标签
plt.title('index10M 10-recall@10 vs. Lacency')
plt.xlabel('Lacency')
plt.ylabel('10-recall@10')

# 显示图例
plt.legend()

# 显示图表
plt.grid(True)
plt.show()